<?php
// +----------------------------------------------------------------------
// | 版权所有: 青岛银狐信息科技有限公司
// +----------------------------------------------------------------------
// | 公司电话: 0532-58770968
// +----------------------------------------------------------------------
// | 功能说明: 友情链接全局调用
// | 调用方法   {:W('Link/lists')}
// +----------------------------------------------------------------------
// | Author: XB.ghost.42 / 吴
// +----------------------------------------------------------------------
// | Date: 2017/9/9
// +----------------------------------------------------------------------    

namespace Home\Widget;
use Think\Controller;

class ModulWidget extends Controller{

    /**
     * 参数： 显示数量
     */
    public function lists(){

        $link = M('sys_modul')->where(array('Status' => 1,'IsDel'=>0))->order('Sort asc,ID desc')->limit(6)->select();

        if(!$link){
            return '';
        }
        $this->assign('modul',$link);

        $this->display('modul:lists');
    }
}
